app/views/sessions/new.html.erb


<%= link_to "Classroom", classroom_path(Classroom.first) %>
---
SELECT  "classrooms".* FROM "classrooms"  ORDER BY "classrooms"."id" ASC LIMIT 1