app/views/classrooms/new.html.erb

    <%=f.label "Co-teacher" %>:
    <%= f.select :teachers, options_for_select(@other_teachers), {}, {multiple: false}  %>
---
SELECT "teachers".* FROM "teachers"