app/controllers/classrooms_controller.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 2]]
---
  def new
    if !logged_in?
      redirect_to root_path
    else
      @teacher = Teacher.find(session[:teacher_id])

INSERT INTO "classrooms" ("name", "schoolyear", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Classroom 1"], ["schoolyear", "2016-2017"], ["created_at", "2016-08-31 16:12:18.198651"], ["updated_at", "2016-08-31 16:12:18.198651"]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 2]]
---
  def create
    @classroom = Classroom.new(name: classroom_params[:name], schoolyear: classroom_params[:schoolyear])
    @classroom.teachers.push(Teacher.find(current_teacher.id))

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @classroom = Classroom.find(params[:id])

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @classroom = Classroom.find(params[:id])