app/controllers/sessions_controller.rb

  def create
    @teacher = Teacher.find_by(username: params[:username])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."username" = ? LIMIT 1  [["username", "danielhomer"]]