app/controllers/subjects_controller.rb

INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test Subject"], ["created_at", "2016-09-14 04:08:38.875204"], ["updated_at", "2016-09-14 04:08:38.875204"]]
---
  def create
    @subject = Subject.new(subject_params)
    if @subject.save