app/controllers/teachers_controller.rb

  def create
    pry
    @teacher = Teacher.new(teacher_params)
    if @teacher.save
---
INSERT INTO "teachers" ("first_name", "last_name", "username", "email", "password_digest", "photo_path", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    if logged_in?
      @teacher = Teacher.find_by(id: params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 2]]